; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_5 ?v11 ?v8)
             (pred_3 ?v3 ?v4)
             (pred_2 ?v11 ?v4)
             (pred_11 ?v13 ?v11 )
	     (pred_9 ?v11)
             (pred_10 ?v1)
             (pred_6 ?v3)
             (pred_4 ?v4)
             (pred_8 ?v11)
             (pred_1 ?v3)
             (pred_12 ?v11)
             (pred_7 ))



(:action op_2
:parameters (?v9 ?v6 ?v7 ?v5)
:precondition (and (pred_10 ?v9) (pred_10 ?v6) (pred_6 ?v7) (pred_4 ?v5)
          (pred_5 ?v9 ?v6) (pred_3 ?v7 ?v5)
                   (pred_2 ?v6 ?v5) (pred_9 ?v9) 
                   (pred_8 ?v6) (pred_1 ?v7))
:effect (and  (pred_12 ?v6) (not (pred_8 ?v6))))


(:action op_5
:parameters (?v9 ?v12)
:precondition (and (pred_10 ?v9) (pred_10 ?v12)
               (pred_9 ?v9) (pred_5 ?v9 ?v12) (pred_12 ?v12))
:effect (and (pred_9 ?v12) (not (pred_9 ?v9))))

(:action op_3
:parameters (?v9 ?v7)
:precondition (and (pred_10 ?v9) (pred_6 ?v7) 
                  (pred_9 ?v9) (pred_11 ?v7 ?v9) (pred_7 ))
:effect (and (pred_1 ?v7)
   (not (pred_11 ?v7 ?v9)) (not (pred_7 ))))


(:action op_1
:parameters (?v9 ?v2 ?v10)
:precondition (and (pred_10 ?v9) (pred_6 ?v2) (pred_6 ?v10)
                  (pred_9 ?v9) (pred_1 ?v10) (pred_11 ?v2 ?v9))
:effect (and (pred_1 ?v2) (pred_11 ?v10 ?v9)
        (not (pred_1 ?v10)) (not (pred_11 ?v2 ?v9))))

(:action op_4
:parameters (?v9 ?v7)
:precondition (and (pred_10 ?v9) (pred_6 ?v7) 
                  (pred_9 ?v9) (pred_1 ?v7))
:effect (and (pred_7 ) (pred_11 ?v7 ?v9) (not (pred_1 ?v7)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_04 obj_10 obj_01 obj_06 obj_03 obj_08 obj_13 obj_07 obj_09
    obj_12 obj_11
    obj_02 obj_05
    )

    (:init
       (pred_7)

       (pred_10 obj_04)
       (pred_10 obj_10)
       (pred_10 obj_01)
       (pred_10 obj_06)
       (pred_10 obj_03)
       (pred_10 obj_08)
       (pred_10 obj_13)
       (pred_10 obj_07)
       (pred_10 obj_09)
       (pred_4 obj_12)
       (pred_4 obj_11)
       (pred_6 obj_02)
       (pred_6 obj_05)

       (pred_5 obj_04 obj_06)
       (pred_5 obj_04 obj_10)
       (pred_5 obj_10 obj_03)
       (pred_5 obj_10 obj_01)
       (pred_5 obj_10 obj_04)
       (pred_5 obj_01 obj_08)
       (pred_5 obj_01 obj_10)
       (pred_5 obj_06 obj_13)
       (pred_5 obj_06 obj_03)
       (pred_5 obj_06 obj_04)
       (pred_5 obj_03 obj_07)
       (pred_5 obj_03 obj_08)
       (pred_5 obj_03 obj_10)
       (pred_5 obj_03 obj_06)
       (pred_5 obj_08 obj_09)
       (pred_5 obj_08 obj_01)
       (pred_5 obj_08 obj_03)
       (pred_5 obj_13 obj_07)
       (pred_5 obj_13 obj_06)
       (pred_5 obj_07 obj_09)
       (pred_5 obj_07 obj_03)
       (pred_5 obj_07 obj_13)
       (pred_5 obj_09 obj_08)
       (pred_5 obj_09 obj_07)
       (pred_8 obj_13)
       (pred_8 obj_09)
       (pred_2  obj_13 obj_12)
       (pred_2  obj_09 obj_11)
       (pred_12 obj_04)
       (pred_12 obj_10)
       (pred_12 obj_01)
       (pred_12 obj_06)
       (pred_12 obj_03)
       (pred_12 obj_08)
       (pred_12 obj_07)

       (pred_3  obj_02 obj_12)
       (pred_3  obj_05 obj_11)
       (pred_11 obj_02 obj_04)
       (pred_11 obj_05 obj_13)
       (pred_9 obj_04)
    )

    (:goal (and
       (pred_11 obj_02 obj_01)
    ))
(:constraints
  (always (not (pred_9 obj_10)))
)
)

; plan
1. (op_3 obj_04 obj_02)
   deleted: (pred_11 obj_02 obj_04) (pred_7)
   added: (pred_1 obj_02)
   goals met: 0 of 1
2. (op_5 obj_04 obj_06)
   deleted: (pred_9 obj_04)
   added: (pred_9 obj_06)
   goals met: 0 of 1
3. (op_5 obj_06 obj_03)
   deleted: (pred_9 obj_06)
   added: (pred_9 obj_03)
   goals met: 0 of 1
4. (op_5 obj_03 obj_08)
   deleted: (pred_9 obj_03)
   added: (pred_9 obj_08)
   goals met: 0 of 1
5. (op_5 obj_08 obj_01)
   deleted: (pred_9 obj_08)
   added: (pred_9 obj_01)
   goals met: 0 of 1
6. (op_4 obj_01 obj_02)
   deleted: (pred_1 obj_02)
   added: (pred_7) (pred_11 obj_02 obj_01)
   goals met: 1 of 1
